docs/studying.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-15 Wed 12:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga65f5ad">1. The optimal studying strategy</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga65f5ad" class="outline-2">
<h2 id="orga65f5ad"><span class="section-number-2">1</span> The optimal studying strategy</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Glance at past year paper questions</li>
</ol>
<p>
Rationale: understand the kind of questions to be asked, prime the
brain for chunking, mental pump
</p>

<ol class="org-ol">
<li>Glance through relevant textbook chapters</li>
</ol>
<p>
Same rationale. Understand the big picture.
</p>

<p>
for n from 1..N
</p>
<ol class="org-ol">
<li>Glance at tutorial n</li>
</ol>
<p>
Understand the problems that typically come out from this chapter.
</p>

<ol class="org-ol">
<li>Glance at textbook chapter subheadings/structure.</li>
</ol>
<p>
Form big picture.
</p>

<ol class="org-ol">
<li>Read textbook with 2 passes minimum.
<ul class="org-ul">
<li>First pass to get general feel, less math</li>
<li>Second pass to understand deeper</li>
</ul></li>
</ol>

<p>
Work through the example problems at least once after first pass, when
encountered during second pass. Attempt to recall during break, in a
different location. Try to solve the problem without referencing
solution.
</p>

<p>
Rework this problem after the break.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-08-15 Wed 12:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
