content/posts/studying.md
+++
title = "Studying"
author = ["Jethro Kuan"]
lastmod = 2020-06-24T16:08:53+08:00
draft = false
+++

## The optimal studying strategy {#the-optimal-studying-strategy}

1.  Glance at past year paper questions

Rationale: understand the kind of questions to be asked, prime the
brain for chunking, mental pump

1.  Glance through relevant textbook chapters

Same rationale. Understand the big picture.

for n from 1..N

1.  Glance at tutorial n

Understand the problems that typically come out from this chapter.

1.  Glance at textbook chapter subheadings/structure.

Form big picture.

1.  Read textbook with 2 passes minimum.
    - First pass to get general feel, less math
    - Second pass to understand deeper

Work through the example problems at least once after first pass, when
encountered during second pass. Attempt to recall during break, in a
different location. Try to solve the problem without referencing
solution.

Rework this problem after the break.
